In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [53]:
#customers_1
df = pd.read_csv("C:/Users/Madhava/Downloads/Customers.csv",encoding='latin-1')
df.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [5]:
df.shape

(15266, 10)

In [54]:
missing_value = df.isnull().sum()
missing_value

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [55]:
missing_rows = df[df.isna().any(axis=1)]
missing_rows

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
5304,729681,Female,Rossana Padovesi,Polvica,NaN,Napoli,80035,Italy,Europe,4/18/1981
5316,732289,Male,Indro Piccio,Varcaturo,NaN,Napoli,80014,Italy,Europe,2/24/1949
5372,742042,Male,Amaranto Loggia,Casaferro,NaN,Napoli,80034,Italy,Europe,3/14/1936
5377,742886,Female,Edmonda Capon,Terzigno,NaN,Napoli,80040,Italy,Europe,8/6/1963
5378,743343,Female,Ambra Sagese,Pomigliano D'Arco,NaN,Napoli,80038,Italy,Europe,1/5/1961
5485,759705,Male,Callisto Lo Duca,Casilli,NaN,Napoli,80047,Italy,Europe,8/28/1976
5525,765589,Male,Michelino Lucchesi,Pompei Scavi,NaN,Napoli,80045,Italy,Europe,11/13/1947
5531,766410,Male,Adelmio Beneventi,Licola,NaN,Napoli,80078,Italy,Europe,1/13/1940
5631,781667,Female,Ilda Manna,Napoli,NaN,Napoli,80134,Italy,Europe,5/8/1977
5695,789177,Male,Calogero Folliero,Mariglianella,NaN,Napoli,80030,Italy,Europe,3/3/2000

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [57]:
df["State Code"].fillna('NA',inplace = True)

In [58]:
df.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [59]:
df['Birthday'] = pd.to_datetime(df['Birthday'])
df['Zip Code'] = pd.to_numeric(df['Zip Code'], errors='coerce')
df['Zip Code'] = df['Zip Code'].fillna(0).astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  int32
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int32(1), int64(1), object(7)
memory usage: 1.1+ MB

In [60]:
df['Zip Code'] = df['Zip Code'].astype('int64')

In [61]:
df = df.rename(columns={"State Code": "state_code", "Zip Code": "zip_code"})

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   state_code   15266 non-null  object
 5   State        15266 non-null  object
 6   zip_code     15266 non-null  int64
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(7)
memory usage: 1.2+ MB

In [63]:
df.head()

,CustomerKey,Gender,Name,City,state_code,State,zip_code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19

In [16]:
df = pd.DataFrame(df)

In [17]:
df.to_csv('customers.csv')

In [18]:
#products_2
dp = pd.read_csv("C:/Users/Madhava/Downloads/Products.csv",encoding='latin-1')
dp.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [19]:
dp.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [81]:
dp.shape

(2517, 10)

In [20]:
dp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [21]:
dp['Unit Cost USD'] = dp['Unit Cost USD'].str.replace('$', '')
dp['Unit Price USD'] = dp['Unit Price USD'].str.replace('$', '')

In [22]:
dp.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [23]:
dp['Unit Cost USD'] = dp['Unit Cost USD'].str.replace(',', '').str.strip().astype(float)
dp['Unit Price USD'] = dp['Unit Price USD'].str.replace(',', '').str.strip().astype(float)

In [24]:
dp = dp.rename(columns={"Unit Cost USD": "unit_cost", "Unit Price USD": "unit_price", "Product Name": "product_name"})

In [25]:
dp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   product_name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   unit_cost       2517 non-null   float64
 5   unit_price      2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [26]:
dp = pd.DataFrame(dp)

In [27]:
dp.to_csv('products_updated.csv')

In [28]:
#sales_3
ds = pd.read_csv("C:/Users/Madhava/Downloads/Sales.csv",encoding='latin-1')
ds.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [29]:
(ds.isnull().sum()/len(ds))*100

Order Number      0.000000
Line Item         0.000000
Order Date        0.000000
Delivery Date    79.064627
CustomerKey       0.000000
StoreKey          0.000000
ProductKey        0.000000
Quantity          0.000000
Currency Code     0.000000
dtype: float64

In [110]:
ds.columns

Index(['Order Number', 'Line Item', 'Order Date', 'Delivery Date',
       'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency Code'],
      dtype='object')

In [30]:
ds = ds.drop('Delivery Date',axis=1)

In [31]:
ds['Order Date'] = pd.to_datetime(ds['Order Date'])

In [32]:
ds = ds.rename(columns={"Order Number": "order_number", "Line Item": "line_item", "Order Date": "order_date","Currency Code":"currency_code"})

In [33]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_number   62884 non-null  int64
 1   line_item      62884 non-null  int64
 2   order_date     62884 non-null  datetime64[ns]
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   currency_code  62884 non-null  object
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 3.8+ MB

In [34]:
ds = pd.DataFrame(ds)

In [35]:
ds.to_csv('sales_updated.csv')

In [36]:
#stores_4
dst = pd.read_csv("C:/Users/Madhava/Downloads/Stores.csv",encoding='latin-1')
dst.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [37]:
dst.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [38]:
dst.isna().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [39]:
missing_rows = dst[dst.isna().any(axis=1)]
missing_rows

    StoreKey Country   State  Square Meters Open Date
66         0  Online  Online            NaN  1/1/2010

In [40]:
dst['Country'].isin(['Online']).any()

True

In [41]:
(dst['Country'] == 'Online').sum()

1

In [42]:
dst = dst[dst['Country'] != 'Online']

In [43]:
dst['Open Date'] = pd.to_datetime(dst['Open Date'])

In [44]:
dst = dst.rename(columns={"Square Meters": "square_meters", "Open Date": "open_date"})

In [45]:
dst.info()

<class 'pandas.core.frame.DataFrame'>
Index: 66 entries, 0 to 65
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       66 non-null     int64
 1   Country        66 non-null     object
 2   State          66 non-null     object
 3   square_meters  66 non-null     float64
 4   open_date      66 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 3.1+ KB

In [46]:
dst = pd.DataFrame(dst)

In [47]:
dst.to_csv('stores_updates.csv')

In [48]:
#exchange_rate = 5
der = pd.read_csv("C:/Users/Madhava/Downloads/Exchange_Rates.csv",encoding='latin-1')
der.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [49]:
der.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [136]:
der.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [50]:
der['Date'] = pd.to_datetime(der['Date'])

In [51]:
der.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [52]:
der.to_csv('exchange_rates_updates.csv')

In [194]:
import pymysql
import pandas as pd
myconnection = pymysql.connect(host ='127.0.0.1',user = 'root',passwd = 'Ammulu@7',database = 'dataspark')

In [196]:
myconnection = pymysql.connect(host ='127.0.0.1',user = 'root',passwd = 'Ammulu@7',database = "dataspark")

In [141]:
mycursor.execute("create database DataSpark")

1

In [185]:
len(df)

15266

In [198]:
mycursor.execute("USE dataspark")

0

In [200]:
#customers
a=",".join(f"{i} {j}"
for i,j in zip(df.columns,df.dtypes)).replace("float64","float").replace("category","text").replace("int64","int").replace("object","text").replace("datetime64[ns]","date")
f"create table customers ({a})"
myconnection.cursor().execute(f"create table customers ({a})")
for index, row in df.iterrows():
    insert_query = f"""
    INSERT INTO customers (CustomerKey, Gender, Name, City, state_code, State, zip_code, Country, Continent, Birthday)
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"""
    values = (row['CustomerKey'], row['Gender'], row['Name'], row['City'],
              row['state_code'], row['State'], row['zip_code'], 
              row['Country'], row['Continent'], row['Birthday'])
    myconnection.cursor().execute(insert_query, values)
    myconnection.commit()

In [209]:
#products
a=",".join(f"{i} {j}"
for i,j in zip(dp.columns,dp.dtypes)).replace("float64","float").replace("category","text").replace("int64","int").replace("object","text").replace("datetime64[ns]","date")
f"create table products ({a})"
myconnection.cursor().execute(f"create table products ({a})")

0

In [211]:
sql = "insert into dataspark.products values"
for i in range(len(dp)):
    myconnection.cursor().execute(f"{sql} {tuple(dp.iloc[i])}")
    myconnection.commit()

In [218]:
#sales
a=",".join(f"{i} {j}"
for i,j in zip(ds.columns,ds.dtypes)).replace("float64","float").replace("category","text").replace("int64","int").replace("object","text").replace("datetime64[ns]","date")
f"create table sales ({a})"
myconnection.cursor().execute(f"create table sales ({a})")
sql = "insert into dataspark.sales values"
for i in range(len(ds)):
    myconnection.cursor().execute(f"{sql} {tuple(ds.iloc[i])}")
    myconnection.commit()

In [ ]:
#stores
a=",".join(f"{i} {j}"
for i,j in zip(dst.columns,dst.dtypes)).replace("float64","float").replace("category","text").replace("int64","int").replace("object","text").replace("datetime64[ns]","date")
f"create table stores ({a})"
myconnection.cursor().execute(f"create table stores ({a})")
sql = "insert into dataspark.stores values"
for i in range(len(dst)):
    myconnection.cursor().execute(f"{sql} {tuple(dst.iloc[i])}")
    myconnection.commit()

In [222]:
#exchange_rates
a=",".join(f"{i} {j}"
for i,j in zip(der.columns,der.dtypes)).replace("float64","float").replace("category","text").replace("int64","int").replace("object","text").replace("datetime64[ns]","date")
f"create table exchange_rates ({a})"
myconnection.cursor().execute(f"create table exchange_rates ({a})")
sql = "insert into dataspark.exchange_rates values"
for i in range(len(der)):
    myconnection.cursor().execute(f"{sql} {tuple(der.iloc[i])}")
    myconnection.commit()